УТ_для_edt/src/Documents/смартУстановкаМаксимальныхСкидок/смартУстановкаМаксимальныхСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУстановкаМаксимальныхСкидок</name>
  <comment>//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.</comment>
  <registerRecords>InformationRegister.смартМаксимальныеСкидки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяСкидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяСкидкаДляДилеров</name>
      <comment>//++ #Б5044 смарт: Шляпников 25.11.2025 / Доработка документа Установка максимальных скидок.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменена</name>
      <comment>//++ #Б5044 смарт: Шляпников 25.11.2025 / Доработка документа Установка максимальных скидок.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗапрещена</name>
      <comment>//++ #Б5044 смарт: Шляпников 25.11.2025 / Доработка документа Установка максимальных скидок.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартМаксимальныеСкидки/смартМаксимальныеСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартМаксимальныеСкидки</name>
  <comment>//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МаксимальнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменена</name>
    <comment>//++ #Б5044 смарт: Шляпников 25.11.2025 / Доработка документа Установка максимальных скидок.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗапрещена</name>
    <comment>//++ #Б5044 смарт: Шляпников 25.11.2025 / Доработка документа Установка максимальных скидок.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДляДилеров</name>
    <comment>//++ #Б5044 смарт: Шляпников 25.11.2025 / Доработка документа Установка максимальных скидок.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Documents/смартУстановкаМаксимальныхСкидок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.смартМаксимальныеСкидки.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка.Дата КАК Период,
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка.Организация КАК Организация,
	|	смартУстановкаМаксимальныхСкидокТовары.Номенклатура КАК Номенклатура,
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка.Партнер КАК Партнер,
	|	смартУстановкаМаксимальныхСкидокТовары.МаксимальнаяСкидка КАК МаксимальнаяСкидка,
	|	смартУстановкаМаксимальныхСкидокТовары.Отменена КАК Отменена,
	|	смартУстановкаМаксимальныхСкидокТовары.СкидкаЗапрещена КАК СкидкаЗапрещена,
	|	ЛОЖЬ КАК ДляДилеров
	|ИЗ
	|	Документ.смартУстановкаМаксимальныхСкидок.Товары КАК смартУстановкаМаксимальныхСкидокТовары
	|ГДЕ
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка = &Ссылка
	|	И (смартУстановкаМаксимальныхСкидокТовары.МаксимальнаяСкидка > 0
	|			ИЛИ смартУстановкаМаксимальныхСкидокТовары.СкидкаЗапрещена
	|			ИЛИ смартУстановкаМаксимальныхСкидокТовары.Отменена)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка.Дата,
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка.Организация,
	|	смартУстановкаМаксимальныхСкидокТовары.Номенклатура,
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка.Партнер,
	|	смартУстановкаМаксимальныхСкидокТовары.МаксимальнаяСкидкаДляДилеров,
	|	смартУстановкаМаксимальныхСкидокТовары.Отменена,
	|	смартУстановкаМаксимальныхСкидокТовары.СкидкаЗапрещена,
	|	ИСТИНА
	|ИЗ
	|	Документ.смартУстановкаМаксимальныхСкидок.Товары КАК смартУстановкаМаксимальныхСкидокТовары
	|ГДЕ
	|	смартУстановкаМаксимальныхСкидокТовары.Ссылка = &Ссылка
	|	И (смартУстановкаМаксимальныхСкидокТовары.МаксимальнаяСкидкаДляДилеров > 0
	|			ИЛИ смартУстановкаМаксимальныхСкидокТовары.СкидкаЗапрещена
	|			ИЛИ смартУстановкаМаксимальныхСкидокТовары.Отменена)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Движения.смартМаксимальныеСкидки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
	
#КонецЕсли
